benchmark/FieldExamples/semisphericalFEMMembraneWithInternalPressureInFlow/semisphericalFEMMembraneWithInternalPressureInFlowOF/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            groovyBC;
        valueExpression "vector(1,0,0) * pow(min(pos().z,0.5)/0.5,0.142857142)*0.746";
        value           uniform (0 0 0);
    }
    outlet
    {
        type            zeroGradient;
        //type            fixedValue;
        //value           uniform (1 0 0);
    }    
    
    ground
    {
        //type 		slip;
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    interface
    {
        //type 		slip;
        type            movingWallVelocity;
        value           uniform (0 0 0);   
    }
}

// ************************************************************************* //
